inf_avtors = [
    (1, 'Иванов', 'Иван'),
    (2, 'Петров', 'Александр'),
    (3, 'Серов', 'Дмитрий'),
    (4, 'Алексеев', 'Александр'),
    (5, 'Кузнецов', 'Юрий'),
    (6, 'Ершов', 'Павел'),
    (7, 'Ульянов', 'Максим'),
    (8, 'Воронин', 'Даниил'),
    (9, 'Чехова', 'Анна'),
    (10, 'Голышев', 'Матвей'),
    (11, 'Милохин', 'Сергей'),
    (12, 'Шулин', 'Владимир'),
    (13, 'Лихов', 'Нурлан')
]

inf_raz = [
    (1,),
    (2,),
    (3,),
    (4,),
    (5,),
    (6,),
    (7,),
    (8,),
    (9,),
    (10,)
]

inf_izd = [
    (1, 'Москва'),
    (2, 'Санкт-Петербург'),
    (3, 'Пермь'),
    (4, 'Ростов-на-Дону'),
    (5, 'Ярославль'),
    (6, 'Казань'),
    (7, 'Керчь'),
    (8, 'Лондон'),
    (9, 'Новосибирск'),
    (10, 'Батайск')
]

inf_book = [
    (1, 'Империя', 1, 10, 2011, 'Музей г. Нальчик'),
    (2, 'Отречение', 2, 9, 2013, 'Музей г. Керчь'),
    (3, 'От А до Я', 3, 8, 2014, 'Музей им. Гоголя'),
    (4, 'Ревизор', 4, 7, 1998, 'Библиотека №1'),
    (5, 'Варенье и медведь', 5, 6, 2004, 'Музей №4'),
    (6, 'Питон для чайников', 6, 5, 2009, 'Библиотека Азов'),
    (7, 'Маленькая история', 7, 4, 2017, 'Библиотека №6'),
    (8, 'Шило', 8, 3, 2011, 'Склад'),
    (9, 'Кухня', 9, 2, 2000, 'Библиотека №1'),
    (10, 'Столовая', 10, 1, 1990, 'Библиотека №4'),
    (11, 'Корабль', 1, 5, 2019, 'Склад'),
    (12, 'Шишки', 2, 4, 2022, 'Библиотека №1'),
    (13, 'Медведи', 3, 3, 2005, 'Музей 70'),
    (14, 'Лило и Стич', 4, 2, 2005, 'Библиотека №2'),
    (15, 'Варенье и медведь', 5, 1, 2006, 'Музей 70'),
    (16, 'Отцы и дети', 6, 10, 2013, 'Москва'),
    (17, 'Комната', 7, 9, 2010, 'Музей им. Гоголя'),
    (18, 'Караван из Ирана', 8, 8, 1999, 'Библиотека №6'),
    (19, 'Мальчик из гетто', 9, 7, 1997, 'Школа 56'),
    (20, 'Война обезьян', 10, 6, 2004, 'Подвал')
]

inf_a_b = [
    (1, 1, 20),
    (2, 2, 19),
    (3, 3, 18),
    (4, 4, 17),
    (5, 5, 16),
    (6, 6, 15),
    (7, 7, 14),
    (8, 8, 13),
    (9, 9, 12),
    (10, 10, 11),
    (11, 11, 10),
    (12, 12, 9),
    (13, 13, 8),
    (14, 1, 7),
    (15, 2, 6),
    (16, 3, 5),
    (17, 4, 4),
    (18, 5, 2),
    (19, 6, 1),
    (20, 7, 3)
]